///week13-1.cpp聖誕倒數寫程式,第一天第一題
///左下角stdin 可以貼上你的程式input
int main() {
    char c;///字母,對應方向L左轉R右轉
    int d;///數字要轉動幾格
    int now = 50;///一開始密碼鎖指向50
    int ans = 0;///選轉時,有幾次停在0的地方
    while (cin >> c >> d ){///一直讀資料:讀自母,讀數字
        ///if(c=='L') cout << "往左轉" << d <<"格\n";
        ///if(c=='R') cout << "往右轉" << d <<"格\n";
        ///把上面兩行的中文訊息註解掉
        if(c=='L') now = now - d;///減掉
        if(c=='R') now = now + d;///加上

        now = (now%100 + 100) % 100;///太大的,太小的,都限制在0-99間
        ///cout << "現在的刻度是: " << now << "\n";
        if (now==0) ans++;///轉動時,停在0的地方(我們的通關密碼)
    }
    cout << "答案是: " << ans;
}
/*
L68
L30
R48
L5
R60
L55
L1
L99
R14
L82
*/
